modules/Hotel/Models/Hotel.php

    public function beforeCheckout(Request $request, $booking)
    {
        $filters = [
            "start_date" => $booking->start_date,
            "end_date" => $booking->end_date,
            "adults" => $booking->getMeta("adults"),
            "children" => $booking->getMeta("children"),
        ];
        $roomsBookings = HotelRoomBooking::select("room_id")->where("booking_id", $booking->id)->get();
        $room_ids = $roomsBookings->pluck('room_id')->toArray();
        $rooms = HotelRoom::whereIn('id', $room_ids)->get();
---
select `room_id` from `bravo_hotel_room_bookings` where `booking_id` = 2
select * from `bravo_hotel_rooms` where `id` in (37) and `bravo_hotel_rooms`.`deleted_at` is null

    public function detailBookingEachDate($booking)
    {
        $rooms = \Modules\Hotel\Models\HotelRoomBooking::getByBookingId($booking->id);
        $roomsIds = $rooms->pluck('room_id')->toArray();
        $roomsNumber = $rooms->pluck('number', 'room_id')->toArray();
        $startDate = $booking->start_date;
        $endDate = $booking->end_date;
        $query = HotelRoomDate::query();
        $query->whereIn('target_id', $roomsIds);
        $query->where('start_date', '>=', date('Y-m-d H:i:s', strtotime($startDate)));
        $query->where('end_date', '<', date('Y-m-d H:i:s', strtotime($endDate)));
        $roomsDates = $query->get();
---
select * from `bravo_hotel_room_dates` where `target_id` in (37) and `start_date` >= '2026-03-03 00:00:00' and `end_date` < '2026-03-04 00:00:00'